XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G21x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31G21x_Series</name>
  <description>ABOV Semiconductor A31G21x Series Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.5.1" date="2021-05-13">
            -Updated  Pack URL
    </release>
    <release version="1.5.0" date="2021-01-12">
            - Added device : A31G212, A31G213
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31G21x Series</keyword>
    <keyword>General Purpose</keyword>
  </keywords>
  <devices>
    <family Dfamily="A31G21x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV A31G21x Series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
          </description>
      <!-- Subfamily : A31G21x *********************************************************-->
      <subFamily DsubFamily="A31G21x">
        <processor Dclock="48000000" />
        <compile header="A31G21x/Core/include/A31G21x.h" />
        <debug svd="A31G21x/SVD/A31G21x.svd" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="105" />
        <memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1" />
        <!-- Device : A31G213-->
        <device Dname="A31G213">
          <description>Package type 48 LQFP, 44 MQFP, 32 LQFP, 28 TSSOP</description>
          <algorithm name="A31G21x\Flashloader\A31G213_64.FLM" start="0x00000000" size="0x10000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
        <!-- Device : A31G212-->
        <device Dname="A31G212">
          <description>Package type 48 LQFP, 44 MQFP, 32 LQFP, 28 TSSOP</description>
          <algorithm name="A31G21x\Flashloader\A31G212_32.FLM" start="0x00000000" size="0x8000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x8000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- condition : A31G213/212 ********************************************************-->
    <condition id="A31G21x CMSIS">
      <description>A31G213/212 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G213" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G212" />
    </condition>
  </conditions>
  <components>
    <!-- component : A31G213/212 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>System Startup for ABOV A31G213/212 devices</description>
      <files>
        <file category="include" name="A31G21x/Core/include/" />
        <file category="include" name="A31G21x/Drivers/include/" />
        <file category="header" version="1.0.0" name="A31G21x/Core/include/A31G21x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31G21x/Core/include/system_A31G21x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31G21x/Core/source/ARM/startup_A31G21x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31G21x/Core/source/system_A31G21x.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x debug framework</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_aa_types.h" />
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_libcfg.h" />
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_debug_frmwrk.h" />
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_debug_frmwrk_usart.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="adc" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x adc control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_adc.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="crc" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x crc control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_crc.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dmac" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x dmac control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_dmac.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="i2c" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x i2c control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_i2c.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pcu" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x pcu control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_pcu.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pwr" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x pwr control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_pwr.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="scu" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x scu control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_scu.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer1n" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x 16-bit timer control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_timer1n.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_timer1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer2n" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x 32-bit timer control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_timer2n.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_timer2n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer3n" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x 6-ch PWM timer control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_timer30.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_timer30.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="uart" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x uart control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_uartn.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_uartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="usart" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x usart control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_usart1n.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_usart1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="spi" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x spi control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_spi.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wdt" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x watch dog timer control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_wdt.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wt" Cversion="1.0.0" condition="A31G21x CMSIS">
      <description>A31G21x watch timer control</description>
      <files>
        <file category="header" name="A31G21x/Drivers/include/A31G21x_hal_wt.h" />
        <file category="source" name="A31G21x/Drivers/source/A31G21x_hal_wt.c" />
      </files>
    </component>
