XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G21x_Series.pdsc
  </components>
  <boards>
    <!-- board : A31G213 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-A31G213CL2N" revision="V1.1">
      <description>StarterKit-A31G213CL2N</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G213" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G212" />
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs: D101~106" />
      <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin" />
    </board>
  </boards>
  <examples>
    <!-- example : A31G213/212 **********************************************************-->
    <example name="ABOV ADC Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/ADC/Adc_Interrupt">
      <description>ADC Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Polling" doc="Abstract.txt" folder="A31G21x/Examples/ADC/Adc_Polling">
      <description>ADC Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Clock" doc="Abstract.txt" folder="A31G21x/Examples/ClkChange/HSE_SystemClockChange">
      <description>Clock Change example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ClkChange_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Clock" doc="Abstract.txt" folder="A31G21x/Examples/ClkChange/HSI_SystemClockChange">
      <description>Clock Change example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ClkChange_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Clock" doc="Abstract.txt" folder="A31G21x/Examples/ClkChange/LSI_SystemClockChange">
      <description>Clock Change example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ClkChange_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_CCITT">
      <description>CRC CCITT example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT DMA RAM" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_CCITT_DMA_RAM">
      <description>CRC CCITT DMA RAM example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CCITT_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_Checksum">
      <description>CRC Checksum example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_Checksum.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum DMA RAM" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_Checksum_DMA_RAM">
      <description>CRC Checksum DMA RAM example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_Checksum_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_CRC16">
      <description>CRC CRC16 example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CRC16.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16 DMA RAM" doc="Abstract.txt" folder="A31G21x/Examples/CRC/CRC_CRC16_DMA_RAM">
      <description>CRC CRC16 DMA RAM example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CRC16_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DAC TEST" doc="Abstract.txt" folder="A31G21x/Examples/DAC/DAC_Test">
      <description>DAC example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/dac_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write" doc="Abstract.txt" folder="A31G21x/Examples/FMC/FMC_WriteErase">
      <description>FMC Erase Write example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (Self PGM)" doc="Abstract.txt" folder="A31G21x/Examples/FMC/FMC_WriteErase_selfPGM">
      <description>FMC Erase Write (Self PGM) example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (in RAM)" doc="Abstract.txt" folder="A31G21x/Examples/FMC/FMC_WriteErase2_lock_inRAM">
      <description>FMC Erase Write (in RAM) example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO External Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/GPIO/Gpio_ExtInt">
      <description>GPIO External Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_ExtInt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Input" doc="Abstract.txt" folder="A31G21x/Examples/GPIO/Gpio_Input">
      <description>GPIO Input example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED Blinky" doc="Abstract.txt" folder="A31G21x/Examples/GPIO/Gpio_LedBlinky">
      <description>GPIO LED Blinky example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C" doc="Abstract.txt" folder="A31G21x/Examples/I2C/I2C_MasterSlave">
      <description>I2C example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2C_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LED" doc="Abstract.txt" folder="A31G21x/Examples/LED/LedDriver">
      <description>LED Driver example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LedDriver.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR LVI_Interrupt " doc="Abstract.txt" folder="A31G21x/Examples/PWR/LVI_Interrupt">
      <description>PWR LVI_Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LVI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR LVI Polling" doc="Abstract.txt" folder="A31G21x/Examples/PWR/LVI_Polling">
      <description>PWR LVI_Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LVI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR Deep Sleep" doc="Abstract.txt" folder="A31G21x/Examples/PWR/PWR_DeepSleep">
      <description>PWR Deep Sleep example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_DeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR Sleep" doc="Abstract.txt" folder="A31G21x/Examples/PWR/PWR_Sleep">
      <description>PWR Sleep example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI TEST" doc="Abstract.txt" folder="A31G21x/Examples/SPI/SPI_MasterSlave">
      <description>DAC example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="A31G21x/Examples/StarterKit/Gpio_LedBlinky">
      <description>Starter Kit - Gpio_LedBlinky (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Capture" doc="Abstract.txt" folder="A31G21x/Examples/TIMER1n/Timer_Capture">
      <description>TIMER1n Capture example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/TIMER1n/Timer_MatchInterrupt">
      <description>TIMER1n Match Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Polling" doc="Abstract.txt" folder="A31G21x/Examples/TIMER1n/Timer_MatchPolling">
      <description>TIMER1n Match Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n One Shot" doc="Abstract.txt" folder="A31G21x/Examples/TIMER1n/Timer_OneShot">
      <description>TIMER1n One Shot example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n PWM" doc="Abstract.txt" folder="A31G21x/Examples/TIMER1n/Timer_PWM">
      <description>TIMER1n PWM example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Capture" doc="Abstract.txt" folder="A31G21x/Examples/TIMER2n/TIMER2n_Capture">
      <description>TIMER2n Capture example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/TIMER2n/TIMER2n_MatchInterrupt">
      <description>TIMER2n Match Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Polling" doc="Abstract.txt" folder="A31G21x/Examples/TIMER2n/TIMER2n_MatchPolling">
      <description>TIMER2n Match Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n One Shot" doc="Abstract.txt" folder="A31G21x/Examples/TIMER2n/TIMER2n_OneShot">
      <description>TIMER2n One Shot example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n PWM" doc="Abstract.txt" folder="A31G21x/Examples/TIMER2n/TIMER2n_PWM">
      <description>TIMER2n PWM example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER30" doc="Abstract.txt" folder="A31G21x/Examples/TIMER30/TIMER30_PWM">
      <description>TIMER30 example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER30_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/UART/Uart_Interrupt">
      <description>UART Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Polling" doc="Abstract.txt" folder="A31G21x/Examples/UART/Uart_Polling">
      <description>UART Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/USART/SPI_Interrupt">
      <description>USART SPI Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Polling" doc="Abstract.txt" folder="A31G21x/Examples/USART/SPI_Polling">
      <description>USART SPI Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/USART/Uart_Interrupt">
      <description>USART UART Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART Polling" doc="Abstract.txt" folder="A31G21x/Examples/USART/Uart_Polling">
      <description>USART UART Polling example (A31G213/212)</description>
