XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G21x_Series.pdsc
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/USART/Usrt_Interrupt">
      <description>USART USRT Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Usrt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Polling" doc="Abstract.txt" folder="A31G21x/Examples/USART/Usrt_Polling">
      <description>USART USRT Polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Usrt_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/WDT/Wdt_Interrupt">
      <description>WDT Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT polling" doc="Abstract.txt" folder="A31G21x/Examples/WDT/Wdt_polling">
      <description>WDT polling example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Reset" doc="Abstract.txt" folder="A31G21x/Examples/WDT/Wdt_Reset">
      <description>WDT Reset example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT Interrupt" doc="Abstract.txt" folder="A31G21x/Examples/WT/Wt_Interrupt">
      <description>WT Interrupt example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT polling" doc="Abstract.txt" folder="A31G21x/Examples/WT/Wt_polling">
      <description>WT example (A31G213/212)</description>
      <board name="StarterKit-A31G213CL2N" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wt_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
